Revit 2027 API
SpatialElementBoundarySubface.GetSubface Method
 Returns a face that represents the portion of the room face bounded by the boundary element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Face GetSubface()
Public Function GetSubface As Face
public:
Face^ GetSubface()
member GetSubface : unit -> Face
Return Value
Face
 The sub-face.
Remarks
 If the spatial element's face is adjacent to multiple bounding elements (such as two different walls), there will be one sub-face for each portion of the spatial element's face where it is adjacent to one of those room-bounding elements. This is equivalent to the return of GetRoomFace() if the entire room face is created by the boundary element.
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace